src/cf/Catalogs/ВидыДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДисконтныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидкиВДисконтныхКартах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидокВДисконтныхКартах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставСкидок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИменнаяКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовДляНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйМеханизмСкидок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерироватьНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисваиватьНомерКартыКНомеруТелефона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонГенерацииШтрихкода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныГенерацииШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорогиНакопительныхСкидок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НижняяГраница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Comment>Может стоит сделать скидку процентом</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыСкидокВДисконтныхКартах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСкидокВДисконтныхКартах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСкидка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НакопительнаяСкидка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смешанная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыСовместногоПримененияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыСовместногоПримененияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вытеснение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Максимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Умножение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыПериодовДляНакопительныхСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПериодовДляНакопительныхСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текущий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прошлый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесьПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыДисконтныхКарт/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Возвращает текстовое представление интервала.
//
Функция ПолучитьПредставлениеИнтервала(ТабличнаяЧасть, ТекущаяСтрока)

	МаксНижняяГраница = Неопределено;
	СледующаяСтрока = Неопределено;
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		Если (МаксНижняяГраница = Неопределено Или МаксНижняяГраница >= СтрокаТЧ.НижняяГраница)
		   И ТекущаяСтрока.НижняяГраница <= СтрокаТЧ.НижняяГраница
		   И СтрокаТЧ <> ТекущаяСтрока Тогда
			СледующаяСтрока = СтрокаТЧ;
			МаксНижняяГраница = СтрокаТЧ.НижняяГраница;
		КонецЕсли;
	КонецЦикла;

	Если СледующаяСтрока = Неопределено Тогда
		ПредставлениеИнтервала = "От " + СокрЛП(ТекущаяСтрока.НижняяГраница) + " " + ВалютаУчета;
	ИначеЕсли ТекущаяСтрока.НижняяГраница = СледующаяСтрока.НижняяГраница Тогда
		ПредставлениеИнтервала = "ОШИБКА: такая нижняя граница уже есть!";
	Иначе
		ПредставлениеИнтервала = "От " + СокрЛП(ТекущаяСтрока.НижняяГраница) + " до " + СокрЛП(СледующаяСтрока.НижняяГраница) + " " + ВалютаУчета;
	КонецЕсли;

	Возврат ПредставлениеИнтервала;

КонецФункции // ПолучитьПредставлениеИнтервала()

// Процедура обновляет значение в колонке ПредставлениеИнтервала табличной части ПорогиНакопительныхСкидок.
//
&НаКлиенте
Процедура ОбновитьПредставлениеВсехСтрок()

	Для каждого ТекСтр Из Объект.ПорогиНакопительныхСкидок Цикл
		ТекСтр.ПредставлениеИнтервала = ПолучитьПредставлениеИнтервала(Объект.ПорогиНакопительныхСкидок, ТекСтр);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Включение опции автоматических скидок при создании нового вида ДК
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДисконтныеКартыУНФСервер.ПроверитьИУстановитьОпциюАвтоматическиеСкидки();
		ДисконтныеКартыУНФСервер.ПроверитьИСоздатьУсловиеПоДисконтнойКарте();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидСкидкиВДисконтныхКартах) Тогда
		Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.ФиксированнаяСкидка");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ТипКарты) Тогда
		Объект.ТипКарты = Перечисления.ТипыКарт.Штриховая;
	КонецЕсли;	
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	
	ЭтаФорма.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	РаботаСФормойКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
	
	УстановитьВраиантСовместногоПримененияСкидок();
	
	УправлениеВидимостьюНаСервере();
	
	УстановитьПараметрыДС();
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеВидимостьюНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставлениеВсехСтрок();
	
	Если ВариантСовместногоПримененияСкидок = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Вытеснение")
		ИЛИ ВариантСовместногоПримененияСкидок = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Умножение") Тогда
		УстановитьСортировкуСпискаПоПолюПорядок();
	КонецЕсли;
	
	УстановитьДоступностьПризнакаГенерацииШтрихкода();
	УстановитьДоступностьПризнакаПрисвоенияНомераКарты()
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПредставлениеВсехСтрок();
	Оповестить("ПослеЗаписи_ВидыДисконтныхКарт", Объект.Комментарий, Объект.Ссылка);
	СформироватьЗаголовокФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события ПриИзменении элемента ТипКарты.
//
&НаКлиенте
Процедура ТипКартыПриИзменении(Элемент)
	
	Элементы.ШаблонДисконтнойКарты.Доступность = (Объект.ТипКарты <> ПредопределенноеЗначение("Перечисление.ТипыКарт.Штриховая"));
	УстановитьДоступностьПризнакаГенерацииШтрихкода();
	УстановитьДоступностьПризнакаПрисвоенияНомераКарты();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьКартинкуДляКомментария", 0.5, Истина);
	
КонецПроцедуры // КомментарийПриИзменении()

&НаКлиенте
Процедура Подключаемый_УстановитьКартинкуДляКомментария()
	
	РаботаСФормойКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВидСкидкиВДисконтныхКартах.
//
&НаКлиенте
Процедура ВидСкидкиВДисконтныхКартахПриИзменении(Элемент)
	
	УправлениеВидимостьюНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВидПериода.
//
&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВидПериодаПриИзмененииНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении элемента ВидПериода (серверная часть).
//
&НаСервере
Процедура ВидПериодаПриИзмененииНаСервере()
	
	Элементы.Периодичность.Видимость = (Объект.ВидПериода <> ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод"));
	Если Не ЗначениеЗаполнено(Объект.Периодичность) И Элементы.Периодичность.Видимость Тогда
		Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличнойЧасти

// Процедура - обработчик события "ПриОкончанииРедактирования" строки в ТЧ "ПорогиНакопительныхСкидок".
//
&НаКлиенте
Процедура ПорогиНакопительныхСкидокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// После ввода строки отсортируем ТЧ по возрастанию нижней границы.
	Объект.ПорогиНакопительныхСкидок.Сортировать("НижняяГраница");
	ОбновитьПредставлениеВсехСтрок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" для колонки "НижняяГраница" строки в ТЧ "ПорогиНакопительныхСкидок".
//
&НаКлиенте
Процедура ПорогиНакопительныхСкидокНижняяГраницаПриИзменении(Элемент)
	
	ТекСтрЭлемент = Элементы.ПорогиНакопительныхСкидок.ТекущиеДанные;
	ТекСтрЭлемент.ПредставлениеИнтервала = ПолучитьПредставлениеИнтервала(Объект.ПорогиНакопительныхСкидок, ТекСтрЭлемент);
	
КонецПроцедуры

// Процедура - обработчик события "ПослеУдаления" ТЧ "ПорогиНакопительныхСкидок".
//
&НаКлиенте
Процедура ПорогиНакопительныхСкидокПослеУдаления(Элемент)
	
	ОбновитьПредставлениеВсехСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура отвечает за видимость элементов формы в зависимости от вида и типа дисконтной карты.
&НаСервере
Процедура УправлениеВидимостьюНаСервере()

	Если Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка") И
		Объект.ВидПериода.Пустая() Тогда
		Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод");
	КонецЕсли;
	
	Элементы.Скидка.Видимость = (Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.ФиксированнаяСкидка"));
	ЭтоНакопительныеСкидки = (Объект.ВидСкидкиВДисконтныхКартах = ПредопределенноеЗначение("Перечисление.ВидыСкидокВДисконтныхКартах.НакопительнаяСкидка"));
	Элементы.ПорогиНакопительныхСкидок.Видимость = ЭтоНакопительныеСкидки;
	Элементы.ВидПериода.Видимость = ЭтоНакопительныеСкидки;
	Элементы.Периодичность.Видимость = (Объект.ВидПериода <> ПредопределенноеЗначение("Перечисление.ВидыПериодовДляНакопительныхСкидок.ВесьПериод")) И ЭтоНакопительныеСкидки;
	Элементы.ШаблонДисконтнойКарты.Доступность = (Объект.ТипКарты <> ПредопределенноеЗначение("Перечисление.ТипыКарт.Штриховая"));
	
	// Старый механизм скидок
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВидСкидки",						"Видимость",	Объект.СтарыйМеханизмСкидок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Скидка",								"Видимость",	Объект.СтарыйМеханизмСкидок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПериодичностьНакопления",			"Видимость",	Объект.СтарыйМеханизмСкидок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПорогиНакопительныхСкидок",				"Видимость",	Объект.СтарыйМеханизмСкидок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПерейтиКНастройке",						"Видимость",	Не Объект.СтарыйМеханизмСкидок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаАвтоСкидки",						"Видимость",	Не Объект.СтарыйМеханизмСкидок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БонуснаяПрограмма",						"Видимость",	Не Объект.СтарыйМеханизмСкидок);
	
	// Список действующих скидок
	Если Объект.СтарыйМеханизмСкидок Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкаБонусов", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВариантСовместногоПримененияСкидокИБонусов", "ОтображениеПодсказки", ОтображениеПодсказки.Нет);
	Иначе
		ЕстьДействующиеСкидки = ДисконтныеКартыУНФСервер.ЕстьСкидкиПоВидуКарт(Объект.Ссылка, Объект.БонуснаяПрограмма);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокАвтоСкидок", "Видимость", ЕстьДействующиеСкидки);
		ВариантОтображенияПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Если ЕстьДействующиеСкидки Тогда
			ВариантОтображенияПодсказки = ОтображениеПодсказки.Нет;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВариантСовместногоПримененияСкидокИБонусов", "ОтображениеПодсказки", ВариантОтображенияПодсказки);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкаБонусов", "Видимость", ЗначениеЗаполнено(Объект.БонуснаяПрограмма));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокФормы()
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Объект.Наименование;
	Иначе
		АвтоЗаголовок = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКНастройкеСкидок(Команда)
	
	ПерейтиКНастройке();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеБонусов(Команда)
	
	ПерейтиКНастройке(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройке(Бонусов = Ложь)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиКНастройкеЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("ДисконтныеКарты, ВидДК", Истина, Объект.Ссылка);
	ИмяФормыНастройки = "";
	Если Бонусов Тогда
		ПараметрыОткрытия.Вставить("БонуснаяПрограмма", Объект.БонуснаяПрограмма);
	КонецЕсли;
	ИмяФормыНастройки = "Обработка.БонусныеПрограммы.Форма";
	ОткрытьФорму(ИмяФормыНастройки, ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	УправлениеВидимостьюНаСервере();
	Если Элементы.СписокАвтоСкидок.Видимость Тогда
		УстановитьПараметрыДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСовместногоПримененияСкидокНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиКНастройке();
КонецПроцедуры

#КонецОбласти

#Область СортировкаСписка

// Процедура обрабатывает ответ пользователя на вопрос об установке сортировки по реквизиту РеквизитДопУпорядочивания.
//
&НаКлиенте
Процедура ПроверитьСписокПередОперациейОтветПоСортировкеПолучен(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСортировкуСпискаПоПолюПорядок();
	
КонецПроцедуры

// Процедура устанавливает сортировку по полю РеквизитДопУпорядочивания.
//
&НаКлиенте
Процедура УстановитьСортировкуСпискаПоПолюПорядок()
	
	СписокРеквизит = СписокАвтоСкидок;
	
	ПользовательскиеНастройкиПорядка = Неопределено;
	Для Каждого Элемент Из СписокРеквизит.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных") Тогда
			ПользовательскиеНастройкиПорядка = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ПользовательскиеНастройкиПорядка <> Неопределено, НСтр("ru = 'Пользовательская настройка порядка не найдена.'"));
	
	ПользовательскиеНастройкиПорядка.Элементы.Очистить();
	Элемент = ПользовательскиеНастройкиПорядка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Элемент.Использование = Истина;
	Элемент.Поле = Новый ПолеКомпоновкиДанных("РеквизитДопУпорядочивания");
	Элемент.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
КонецПроцедуры

&НаКлиенте
Процедура БонуснаяПрограммаПриИзмененииНаКлиенте(Элемент)
	БонуснаяПрограммаПриИзменении();
КонецПроцедуры

&НаСервере
Процедура БонуснаяПрограммаПриИзменении()
	УстановитьВраиантСовместногоПримененияСкидок();
	УправлениеВидимостьюНаСервере();
	УстановитьПараметрыДС();
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДС()
	СписокАвтоСкидок.Параметры.УстановитьЗначениеПараметра("БонуснаяПрограмма", Объект.БонуснаяПрограмма);
	СписокАвтоСкидок.Параметры.УстановитьЗначениеПараметра("ВидДисконтнойКарты", Объект.Ссылка);
	Элементы.СписокАвтоСкидок.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьВраиантСовместногоПримененияСкидок()
	ВариантСовместногоПримененияСкидок = Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
	Если ВариантСовместногоПримененияСкидок.Пустая() Тогда
		ВариантСовместногоПримененияСкидок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Сложение;
		Константы.ВариантыСовместногоПримененияСкидокНаценок.Установить(ВариантСовместногоПримененияСкидок);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
&НаКлиенте
Процедура УстановитьДоступностьПризнакаГенерацииШтрихкода()
	ДоступностьЭлемента = (Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Штриховая") 
		Или Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Смешанная"));
	Элементы.ГенерироватьНомер.Доступность = ДоступностьЭлемента;
	Если Объект.ГенерироватьНомер И Не ДоступностьЭлемента Тогда
		Объект.ГенерироватьНомер = Ложь;
	КонецЕсли;
	УстановитьВидимостьГенерацииШтрихкода();
КонецПроцедуры


&НаКлиенте
Процедура ГенерироватьНомерПриИзменении(Элемент)
	ПроверитьВзаимоисключенияГенерацииКодаКарты(Истина);
	УстановитьВидимостьГенерацииШтрихкода();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВзаимоисключенияГенерацииКодаКарты(ИзмененаГенерацияШтрихкода = Ложь)
	Если НЕ Объект.ГенерироватьНомер ИЛИ НЕ Объект.ПрисваиватьНомерКартыКНомеруТелефона Тогда
		Возврат;
	КонецЕсли;
	Если ИзмененаГенерацияШтрихкода Тогда
		Объект.ПрисваиватьНомерКартыКНомеруТелефона = Ложь;
	Иначе
		Объект.ГенерироватьНомер = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГенерацииШтрихкода()
	Элементы.ГруппаНастройкаГенерацииНомера.Доступность = Объект.ГенерироватьНомер;
	Если ЗначениеЗаполнено(Объект.ШаблонГенерацииШтрихкода)
		И Не Объект.ГенерироватьНомер Тогда
		Объект.ШаблонГенерацииШтрихкода = ПредопределенноеЗначение("Справочник.ШаблоныГенерацииШтрихкодов.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоИменнаяКартаПриИзменении(Элемент)
	УстановитьДоступностьПризнакаПрисвоенияНомераКарты();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПризнакаПрисвоенияНомераКарты()
	ДоступностьЭлемента = (Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Штриховая") 
		Или Объект.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Смешанная")) И Объект.ЭтоИменнаяКарта;
	Элементы.ПрисваиватьНомерКартыКНомеруТелефона.Доступность = ДоступностьЭлемента;
	Если НЕ ДоступностьЭлемента Тогда
		Объект.ПрисваиватьНомерКартыКНомеруТелефона = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрисваиватьНомерКартыКНомеруТелефонаПриИзменении(Элемент)
	ПроверитьВзаимоисключенияГенерацииКодаКарты();
КонецПроцедуры
